aboutinfor1 = """兴趣使然用以练手写出来的，开源
完全没有任何技术含量，只是整合工作非常麻烦
在此对各大词典和说明书的编篡者和译者表示感谢
难免会有疏漏或错误，欢迎补充指正"""

aboutinfor2 = """纠错补充或者有什么建议,欢迎联系我
(溺水的鱼,QQ:1310623999)
"""

updatelog = """   V1.3.0--23/1/16
   可查询语句修正至2287条
   (去除了大量的重复词条)
   计划增加更多的可查询项(如art、IE)
   ---筛选功能的关键词查询已可用---
   (标签筛选暂不可用)
   帮助界面的标签说明进行了大幅优化
   (增加了其它INI的标签说明)
   现在你可以在关于界面看到Github的仓库链接了

   V1.2.1--23/1/11
   可查询语句修正至2336条
   计划增加更多的可查询项(如art、IE)
   大幅优化了RA2_Entries的词条结构
   优化了文件结构
   优化了应用界面
   预置了筛选功能(暂不可用)

   V1.2.0--23/1/9
   可查询语句增多到2334条
   -----词条已大致整合完成-----
   计划增加更多的可查询项(如IE)
   大幅优化了文件结构
   提高了应用图标的清晰度

   V1.1.0--23/1/7
   可查询语句增多到2056条
   去除了重复语句

   V1.0.0--23/1/6
   目前整合了大部分能用到的语句(1500条)
   主要用来翻译词条语句
   预计在后续版本中补全局变量和Phobos平台
   以及加入新的可查询项
"""

helptext = """   未勾选筛选：
   在输入框内输入词条，点击[查询]按钮或回车
   即可查询词条解释

   勾选筛选：
   在输入框内输入关键词，点击[查询]按钮或回车
   (当然，你也能以空格隔开，输入多个关键词)
   即可在最下方的选择框中看到搜索到的相关词条
   选择词条即可查看解释

   当然你也可以为中间三个选择框设置筛选范围
   ( ! 该功能暂不可用 ! )
   来更精准的查找词条(可以留空)
   第一个为词条的应用标签
   第二个为词条对应的平台
   第三个为词条所属的ini文件
   具体说明请在菜单的'帮助'中查看

"""